question	query
Name the movie with narrator as Trevor Peacock and music composer as Christophe Beck.	SELECT DISTINCT ?uri WHERE {?uri <narrator> <Trevor_Peacock> . ?uri <music> <Christophe_Beck>  . ?uri <type> <Film>}
"Which television show is based in Massachusetts and has opening theme as ""Where Everybody Knows Your Name"" ?"	SELECT DISTINCT ?uri WHERE {?uri <openingTheme> <Where_Everybody_Knows_Your_Name> . ?uri <location> <Massachusetts>  . ?uri <type> <TelevisionShow>}
What television shows are distributed by Broadcast syndication?	SELECT DISTINCT ?uri WHERE {?uri <distributor> <Broadcast_syndication>  . ?uri <type> <TelevisionShow>}
Is Eddie Bravo the trainer of Alan Jouban	ASK WHERE { <Alan_Jouban> <trainer> <Eddie_Bravo> }
Name everyone working for a company owned by Roman Abramovich.	SELECT DISTINCT ?uri WHERE { ?x <owningCompany> <Roman_Abramovich> . ?uri <occupation> ?x  . }
Count the awards won by the people who graduated from the National and Kapodistrian University of Athens.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <almaMater> <National_and_Kapodistrian_University_of_Athens> . ?x <award> ?uri  . }
What genre's software are released with a GNU GPL license?	SELECT DISTINCT ?uri WHERE { ?x <license> <GNU_General_Public_License> . ?x <genre> ?uri  . }
Was Gumus TV series first aired in Albania?	ASK WHERE { <Gümüş_(TV_series)> <firstAired> <Albania> }
Count the number of sports played by the universities which also plays Volleyball?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <athletics> <Volleyball> . ?x <athletics> ?uri }
"Which country's national motto is ""Truth prevails""?"	SELECT DISTINCT ?uri WHERE {?uri <nationalMotto> <Truth_prevails>  . ?uri <type> <Country>}
List the notable work of David Isaacs?	SELECT DISTINCT ?uri WHERE { <David_Isaacs_(writer)> <notableWork> ?uri }
List the base currency of the country whose anthem is Oj, svijetla majska zoro.	SELECT DISTINCT ?uri WHERE { ?x <anthem> <Oj,_svijetla_majska_zoro> . ?x <currency> ?uri  . }
Who founded the Not on our Watch?	SELECT DISTINCT ?uri WHERE { <Not_on_Our_Watch_(organization)> <foundedBy> ?uri }
List the name of the soccer clubs whose chairman is Joan Laporta.	SELECT DISTINCT ?uri WHERE { ?x <chairman> <Joan_Laporta> . ?x <name> ?uri  . ?x <type> <SoccerClub>}
Which country of Montanas Mayas Chiquibul is the birth place of Jos Bernardo Escobar?	SELECT DISTINCT ?uri WHERE { <Montañas_Mayas_Chiquibul> <country> ?uri. <José_Bernardo_Escobar> <birthPlace> ?uri . }
What are some movies whose distributor's CEO is Ted Hartley?	SELECT DISTINCT ?uri WHERE { ?x <keyPeople> <Ted_Hartley> . ?uri <distributor> ?x  . ?uri <type> <Film>}
For everyone who died in paris, count their different fields of work.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <deathPlace> <Paris> . ?x <fields> ?uri  . }
Whose famous works are Maniac Magee and Wringer ?	SELECT DISTINCT ?uri WHERE { ?uri <notableworks> <Maniac_Magee> . ?uri <notableworks> <Wringer_(novel)> . }
Who is the common manager of Aston Villa 2000-01 season and also the manager of Middlesbrough F.C. season 2009-10	SELECT DISTINCT ?uri WHERE { <2000–01_Aston_Villa_F.C._season> <name> ?uri. <2009–10_Middlesbrough_F.C._season> <manager> ?uri}
How many people are in the militia?	SELECT DISTINCT COUNT(?uri) WHERE {?uri <branch> <Militia>  . }
Count the number of actors in Lucy Sullivan Is Getting Married.	SELECT DISTINCT COUNT(?uri) WHERE { <Lucy_Sullivan_Is_Getting_Married> <starring> ?uri  . }
Count the number of people who graduated from universities affiliated with the NCAA.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <athletics> <National_Collegiate_Athletic_Association> . ?uri <education> ?x  . ?uri <type> <Person>}
Which high school of Jerry Tagge was also the place where Temptation Waits was recorded?	SELECT DISTINCT ?uri WHERE { <Jerry_Tagge> <highSchool> ?uri. <Temptation_Waits> <recordedIn> ?uri}
What award was won by the executive producer of Shaun the Sheep?	SELECT DISTINCT ?uri WHERE { <Shaun_the_Sheep> <executiveProducer> ?x . ?x <award> ?uri  . }
Count the units garrisoned at Arlington County, Virginia.	SELECT DISTINCT COUNT(?uri) WHERE {?uri <garrison> <Arlington_County,_Virginia>  . ?uri <type> <MilitaryUnit>}
How many other schools are there of the rugby players whose school is Michaelhouse ?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <school> <Michaelhouse> . ?x <school> ?uri }
Peanuts Motion Comics and The Peanuts Movie are the voice of whom?	SELECT DISTINCT ?uri WHERE { ?uri <voice> <Peanuts_Motion_Comics> . ?uri <voice> <The_Peanuts_Movie> . }
Which allegiance of John Kotelawala is also the sovereign state of Sanath Weerakoon ?	SELECT DISTINCT ?uri WHERE { <John_Kotelawala> <allegiance> ?uri. <Sanath_Weerakoon> <country> ?uri}
List the universities from a country where Norwegian language is officially accepted.	SELECT DISTINCT ?uri WHERE { ?x <officialLanguage> <Norwegian_language> . ?uri <country> ?x  . ?uri <type> <University>}
List the resting place of the people who served in Norwalk Trainband.	SELECT DISTINCT ?uri WHERE { ?x <militaryUnit> <Norwalk_Trainband> . ?x <restingplace> ?uri  . ?x <type> <Person>}
Give me some software which run on mac os.	SELECT DISTINCT ?uri WHERE {?uri <operatingSystem> <Mac_OS>  . ?uri <type> <Software>}
List down the common sports played by PATTS College of Aeronautics and Polytechnic University of the Philippines Taguig?	SELECT DISTINCT ?uri WHERE { <PATTS_College_of_Aeronautics> <athletics> ?uri. <Polytechnic_University_of_the_Philippines_Taguig> <sport> ?uri}
Count the number of religions followed by Janta Dal members.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <party> <Janata_Dal> . ?x <religion> ?uri  . }
What basketball league's champion is Golden State Warriors?	SELECT DISTINCT ?uri WHERE {?uri <champion> <Golden_State_Warriors>  . ?uri <type> <BasketballLeague>}
List the sports played in private universities.	SELECT DISTINCT ?uri WHERE { ?x <type> <Private_university> . ?x <sport> ?uri  . }
List the authors of the musicals whose songwriter is Richard M. Sherman.	SELECT DISTINCT ?uri WHERE { ?x <musicBy> <Richard_M._Sherman> . ?x <author> ?uri  . ?x <type> <Musical>}
List all the presidents of the schools which had atleast one of the president as Queen Noor of Jordan ?	SELECT DISTINCT ?uri WHERE { ?x <president> <Queen_Noor_of_Jordan> . ?x <president> ?uri  . ?x <type> <School>}
What is the river with mouth in Southend-on-Sea?	SELECT DISTINCT ?uri WHERE {?uri <mouthMountain> <Southend-on-Sea>  . ?uri <type> <River>}
List the alma mater of the person who is wedded to Sissela Bok.	SELECT DISTINCT ?uri WHERE { ?x <spouse> <Sissela_Bok> . ?x <almaMater> ?uri  . }
What is the area of the Tar Heel Sports Network which is official residence of Michael Nichols (photographer)?	SELECT DISTINCT ?uri WHERE { <Tar_Heel_Sports_Network> <area> ?uri. <Michael_Nichols_(photographer)> <residence> ?uri}
Which players participate in the football seasons headed by Patricia Amorim?	SELECT DISTINCT ?uri WHERE { ?x <chairman> <Patrícia_Amorim> . ?x <name> ?uri  . ?x <type> <SportsSeason>}
Count the territories of the wars where the QF Hotchkiss was used.	SELECT DISTINCT COUNT(?uri) WHERE { <QF_6-pounder_Hotchkiss> <usedInWar> ?x . ?x <territory> ?uri  . ?x <type> <MilitaryConflict>}
Which awards has Puerto Ricons won?	SELECT DISTINCT ?uri WHERE { ?x <ethnicity> <Puerto_Rico> . ?x <awards> ?uri  . }
List the producers of the television shows distributed by FremantleMedia.	SELECT DISTINCT ?uri WHERE { ?x <distributor> <FremantleMedia> . ?x <producer> ?uri  . ?x <type> <TelevisionShow>}
Name the stadiums of 2015 Pro Duta FC season?	SELECT DISTINCT ?uri WHERE { <2015_Pro_Duta_FC_season> <stadium> ?uri }
Which place is Penobscot Island Air founded and is also the birthplace of Ellei Johndro?	SELECT DISTINCT ?uri WHERE { <Penobscot_Island_Air> <founded> ?uri. <Ellei_Johndro> <birthPlace> ?uri}
List the movies whose editors are born in London.	SELECT DISTINCT ?uri WHERE { ?x <placeOfBirth> <London> . ?uri <editing> ?x  . ?uri <type> <Film>}
In which religions are both Pope Gregory 1 and Edwin of Northumbria revered?	SELECT DISTINCT ?uri WHERE { <Pope_Gregory_I> <veneratedIn> ?uri. <Edwin_of_Northumbria> <veneratedIn> ?uri . }
Where is the headquarters of Sigma TV	SELECT DISTINCT ?uri WHERE { <Sigma_TV> <headquarters> ?uri }
Which officer's final resting place is North Bend, ohio and belongs to Indiana Territory branch?	SELECT DISTINCT ?uri WHERE {?uri <restingplace> <North_Bend,_Ohio> . ?uri <branch> <Indiana_Territory>  . }
Is Michael Schumacher the first driver of the 1994 Hungarian grand prix?	ASK WHERE { <1994_Hungarian_Grand_Prix> <firstDriver> <Michael_Schumacher> }
In how many places were the albums of King Crimson recorded?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <artist> <King_Crimson> . ?x <recordedIn> ?uri  . }
List all the tenants of the stadium where the WWF Summer Slam 2004 took place.	SELECT DISTINCT ?uri WHERE { <SummerSlam_(2004)> <venue> ?x . ?x <tenant> ?uri  . }
What is the official residence of the Christopher Daz Figuero which is also the state of the Cruce a Nado Internacional	SELECT DISTINCT ?uri WHERE { <Christopher_Díaz_Figueroa> <residence> ?uri. <Cruce_a_Nado_Internacional> <country> ?uri}
Count the number of judges who've come on CTV network shows.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <network> <CTV_Television_Network> . ?x <judges> ?uri  . }
Count the number of first drivers in all the GPs where Mika Hakkinen was a pole driver?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <poleDriver> <Mika_Häkkinen> . ?x <firstDriver> ?uri  . ?uri <type> <RacingDriver>}
List down the companies whose programming language was designed by Bjarne Stroustrup?	SELECT DISTINCT ?uri WHERE { ?x <designer> <Bjarne_Stroustrup> . ?uri <programmingLanguage> ?x  . ?uri <type> <Company>}
List the books whose authors are born in Alcal de Henares.	SELECT DISTINCT ?uri WHERE { ?x <birthPlace> <Alcalá_de_Henares> . ?uri <author> ?x  . ?uri <type> <Book>}
Give me the count of all the names of characters created by Frank Miller	SELECT DISTINCT COUNT(?uri) WHERE { ?x <creators> <Frank_Miller_(comics)> . ?x <characterName> ?uri  . }
Which interest of Philip Novak is the religion of Vesak?	SELECT DISTINCT ?uri WHERE { <Philip_Novak> <mainInterests> ?uri. <Vesak> <type> ?uri}
Which river flows through both eastern and central washington?	SELECT DISTINCT ?uri WHERE { <Eastern_Washington> <river> ?uri. <Central_Washington> <river> ?uri . }
Give me some series related to the one which had Yasmin Paige in them.	SELECT DISTINCT ?uri WHERE { ?x <starring> <Yasmin_Paige> . ?uri <related> ?x  . ?uri <type> <TelevisionShow>}
List the academic discipline of the journals whose publisher is SAGE Publications.	SELECT DISTINCT ?uri WHERE { ?x <publisher> <SAGE_Publications> . ?x <academicDiscipline> ?uri  . ?x <type> <AcademicJournal>}
What is the total number of regions served by the companies which also serve Australia?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <regionServed> <Australia> . ?x <regionServed> ?uri }
How many teams have used the stadiums which have been rented by the Canadian Hockey Association?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <tenant> <Hockey_Canada> . ?x <tenants> ?uri  . }
Who is the person that first ascentded the Cathedral Peak and Mount Hoffmann?	SELECT DISTINCT ?uri WHERE { <Cathedral_Peak_(California)> <firstAscentPerson> ?uri. <Mount_Hoffmann> <firstAscentPerson> ?uri . }
Which company offer service of Outlook and OneDrive?	SELECT DISTINCT ?uri WHERE { ?uri <services> <Outlook.com> . ?uri <services> <OneDrive> . ?uri <type> <Company>}
Which scientist advised a doctoral student named Serban Titeica?	SELECT DISTINCT ?uri WHERE {?uri <doctoralStudents> <Șerban_Țițeica>  . ?uri <type> <Scientist>}
List the first drivers of Grand Prixes where Mika Hakkinen was a pole driver.	SELECT DISTINCT ?uri WHERE { ?x <poleDriver> <Mika_Häkkinen> . ?x <firstDriver> ?uri  . ?x <type> <GrandPrix>}
Count all the shows whose music composers are in Oysterhead.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <associatedMusicalArtist> <Oysterhead> . ?uri <themeMusicComposer> ?x  . ?uri <type> <TelevisionShow>}
Where did the aristocrats die whose mother was Maria Ludwika Krasinska?	SELECT DISTINCT ?uri WHERE { ?x <mother> <Maria_Ludwika_Krasińska> . ?x <deathPlace> ?uri  . ?x <type> <Royalty>}
Name the company founded by Jim Harris and located in Harris County, Texas ?	SELECT DISTINCT ?uri WHERE {?uri <foundedBy> <Jim_Harris_(entrepreneur)> . ?uri <locationCity> <Harris_County,_Texas>  . ?uri <type> <Company>}
How many other families of the mammals exists whose one family is also Hominidae?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <family> <Hominidae> . ?x <family> ?uri }
Name the airlines which have a hub in airport in San Francisco?	SELECT DISTINCT ?uri WHERE { ?x <cityServed> <San_Francisco> . ?uri <hubs> ?x  . ?uri <type> <Airline>}
Which sport of Vishwajyot High School is also the genre of Battle chess	SELECT DISTINCT ?uri WHERE { <Battle_Chess> <genre> ?uri. <Vishwajyot_High_School> <sport> ?uri}
For what is Robert Nutting famous?	SELECT DISTINCT ?uri WHERE { <Robert_Nutting> <knownFor> ?uri }
List the products of the company which published Tweenies: Game Time.	SELECT DISTINCT ?uri WHERE { <Tweenies:_Game_Time> <publisher> ?x . ?x <products> ?uri  . }
What sport played at Islamic azad uni it also employs Craig Van Tilbury?	SELECT DISTINCT ?uri WHERE { <Craig_Van_Tilbury> <occupation> ?uri. <Islamic_Azad_University_Central_Tehran_Branch> <sport> ?uri}
Does Walt Disney Studio have a subsidiary called Pixar?	ASK WHERE { <Walt_Disney_Studios_(division)> <subsidiary> <Pixar> }
What is the nationality of the J. T. Krogh which is also the sovereign state of the Camilla Martin?	SELECT DISTINCT ?uri WHERE { <J._T._Krogh> <nationality> ?uri. <Camilla_Martin> <country> ?uri}
What is the common university of vanderbilt Commodores and also the college of hubert Wiggs?	SELECT DISTINCT ?uri WHERE { <Vanderbilt_Commodores> <university> ?uri. <Hubert_Wiggs> <college> ?uri}
The successor of Ellsworth Bunker belongs to which region?	SELECT DISTINCT ?uri WHERE { <Ellsworth_Bunker> <successor> ?x . ?x <region> ?uri  . }
Which mascot of Seneca Academy is also the species of The Fox and the Cat ?	SELECT DISTINCT ?uri WHERE { <The_Fox_and_the_Cat> <species> ?uri. <Seneca_Academy_and_Circle_School> <mascot> ?uri}
Who served as a governor of Indiana Territory?	SELECT DISTINCT ?uri WHERE {?uri <branch> <Indiana_Territory> }
What show has theme music composer as Ron Grainer and at the same time is related to Class (2016 TV series)?	SELECT DISTINCT ?uri WHERE {?uri <themeMusicComposer> <Ron_Grainer> . ?uri <related> <Class_(2016_TV_series)>  . ?uri <type> <TelevisionShow>}
What is the death place of the Elbieta Czartoryska which is also place of birth of the Charles Journet	SELECT DISTINCT ?uri WHERE { <Elżbieta_Czartoryska_(1905–1989)> <deathPlace> ?uri. <Charles_Journet> <birthPlace> ?uri}
Name the mascot of the military branch of William Harper.	SELECT DISTINCT ?uri WHERE { <William_Harper_(Rhodesian_politician)> <militaryBranch> ?x . ?x <mascot> ?uri  . }
List some writers which speak one of the Germanic languages.	SELECT DISTINCT ?uri WHERE { ?x <languageFamily> <Germanic_languages> . ?uri <language> ?x  . ?uri <type> <Writer>}
List the served region of the organisations of Trade association.	SELECT DISTINCT ?uri WHERE { ?x <type> <Trade_association> . ?x <regionServed> ?uri  . ?x <type> <Organisation>}
Name the common alma mater of the Henry Morton Dexter and Jack McGregor.	SELECT DISTINCT ?uri WHERE { <Henry_Morton_Dexter> <education> ?uri. <Jack_McGregor> <education> ?uri . }
List the awards given to the relatives of Gregorios Bernardakis.	SELECT DISTINCT ?uri WHERE { <Gregorios_Bernardakis> <relative> ?x . ?x <award> ?uri  . }
Give me some shows related to the ones created by Russell Davies	SELECT DISTINCT ?uri WHERE { ?x <creator> <Russell_T_Davies> . ?uri <related> ?x  . ?uri <type> <TelevisionShow>}
Who coached the marquet golden eagels during 2013	SELECT DISTINCT ?uri WHERE { <2013–14_Marquette_Golden_Eagles_men's_basketball_team> <coach> ?uri }
What is the operating system of the LG Optimus Vu and also the developer of the Dart (programming language)	SELECT DISTINCT ?uri WHERE { <LG_Optimus_Vu> <operatingSystem> ?uri. <Dart_(programming_language)> <developer> ?uri}
List the parts of the settlements which has a part named Seguin, Texas.	SELECT DISTINCT ?uri WHERE { ?x <part> <Seguin,_Texas> . ?x <part> ?uri  . ?x <type> <Settlement>}
List the leaders of the government agencies whose jurisdiction was German-occupied Europe.	SELECT DISTINCT ?uri WHERE { ?x <jurisdiction> <German-occupied_Europe> . ?x <leader> ?uri  . ?x <type> <GovernmentAgency>}
Is Serbian Titieca a doctoral student of Werner Heisenberghttp://dbpedia.org/resource/Werner_Heisenberg	ASK WHERE { <Werner_Heisenberg> <doctoralStudent> <Șerban_Țițeica> }
List the television shows whose distributors are located at Burbank, California.	SELECT DISTINCT ?uri WHERE { ?x <locationCity> <Burbank,_California> . ?uri <distributor> ?x  . ?uri <type> <TelevisionShow>}
WHich region of the Providence Chapel, Charlwood is also the region of the Joseph Case High School	SELECT DISTINCT ?uri WHERE { <Providence_Chapel,_Charlwood> <style> ?uri. <Joseph_Case_High_School> <region> ?uri}
What is the place of birth of the Michael Marder which is also the  place of death of the Tigran Petrosian	SELECT DISTINCT ?uri WHERE { <Michael_Marder> <placeOfBirth> ?uri. <Tigran_Petrosian> <deathPlace> ?uri}
