question	query
Who first ascended a mountain of Cathedral Peak (California)?	SELECT DISTINCT ?uri WHERE { <Cathedral_Peak_(California)> <firstAscentPerson> ?uri }
How many other genre are there of the radio stations whose one of the genre is Classic rock?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <programmeFormat> <Classic_rock> . ?x <programmeFormat> ?uri }
What magazines are form the Limited liability company?	SELECT DISTINCT ?uri WHERE {?uri <company> <Limited_liability_company>  . ?uri <type> <Magazine>}
Count the awards given to the recepients of the Becket fund for religious liberty.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <award> <Becket_Fund_for_Religious_Liberty> . ?x <awards> ?uri  . }
What is the place of birth of the Kira Plastinina and Sergey Ryazansky?	SELECT DISTINCT ?uri WHERE { <Kira_Plastinina> <placeOfBirth> ?uri. <Sergey_Ryazansky> <placeOfBirth> ?uri . }
Who was succeeded by Arthur Gegei as the office holder ?	SELECT DISTINCT ?uri WHERE {?uri <successor> <Artúr_Görgei>  . }
Which company owns the airlines whose hub is in Detroit?	SELECT DISTINCT ?uri WHERE { ?x <hubs> <Detroit> . ?x <parent> ?uri  . ?x <type> <Airline>}
Where did the office holder who has predecessor Marco Aurelio Robles died?	SELECT DISTINCT ?uri WHERE { ?x <predecessor> <Marco_Aurelio_Robles> . ?x <placeOfDeath> ?uri  . ?x <type> <OfficeHolder>}
Count the number of religions followed by the alumini of Ananda College.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <almaMater> <Ananda_College> . ?x <religion> ?uri  . }
List the former partner of the figure skaters whose former choreographer was Igor Shpillband.	SELECT DISTINCT ?uri WHERE { ?x <formerChoreographer> <Igor_Shpillband> . ?x <formerPartner> ?uri  . ?x <type> <FigureSkater>}
Which company was founded by Fusajiro Yamauchi?	SELECT DISTINCT ?uri WHERE {?uri <foundedBy> <Fusajiro_Yamauchi>  . ?uri <type> <Company>}
In which city wasthe Live at The Triple Door (The Courage album) performed?	SELECT DISTINCT ?uri WHERE { <Live_at_The_Triple_Door_(The_Courage_album)> <recorded> ?uri }
Who have John Randolph of Roanoke as predecessor?	SELECT DISTINCT ?uri WHERE {?uri <predecessor> <John_Randolph_of_Roanoke>  . }
Count the religions followed by people living in British Columbia.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <residence> <British_Columbia> . ?x <religion> ?uri  . }
What is a salthill?	SELECT DISTINCT ?uri WHERE { <Salthill> <type> ?uri }
Give me a count of everything under the archipelago, where Papeete is the biggest town.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <largestCity> <Papeete> . ?uri <archipelago> ?x  . }
List the relegion of Otani University which is also the life stance of udit Raj ?	SELECT DISTINCT ?uri WHERE { <Ōtani_University> <affiliation> ?uri. <Udit_Raj> <religion> ?uri}
Which college of Luke List (golfer) is the alma mater of K. Terry Dornbush?	SELECT DISTINCT ?uri WHERE { <Luke_List_(golfer)> <college> ?uri. <K._Terry_Dornbush> <almaMater> ?uri}
Give me the characters who last appeared in Star Wars Episode 3.	SELECT DISTINCT ?uri WHERE {?uri <last> <Star_Wars:_Episode_III_–_Revenge_of_the_Sith> }
Count all the things licensed as Software as a service.	SELECT DISTINCT COUNT(?uri) WHERE {?uri <license> <Software_as_a_service>  . }
Name a famous relative of barry voight	SELECT DISTINCT ?uri WHERE {?uri <relative> <Barry_Voight>  . }
What political party has governed both in Baraily and Jowai?	SELECT DISTINCT ?uri WHERE { <Baraily> <leaderName> ?uri. <Jowai> <leaderName> ?uri . }
Count the drinks originated in England.	SELECT DISTINCT COUNT(?uri) WHERE {?uri <origin> <England>  . ?uri <type> <Beverage>}
Count all the places where companies located in Ontario operate.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <locationCity> <Ontario> . ?x <locations> ?uri  . }
Who are the children of Martin Crane?	SELECT DISTINCT ?uri WHERE { <Martin_Crane> <children> ?uri }
What automobile engine's successor is BMW M40?	SELECT DISTINCT ?uri WHERE {?uri <successor> <BMW_M40>  . ?uri <type> <AutomobileEngine>}
Total number of places where people drafted by the detroit pistons have died?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <draftTeam> <Detroit_Pistons> . ?x <placeOfDeath> ?uri  . ?uri <type> <Location>}
How many software run on operating system Microsoft Windows?	SELECT DISTINCT COUNT(?uri) WHERE {?uri <operatingSystem> <Microsoft_Windows>  . ?uri <type> <Software>}
Where did Georges Wolinski and Judson Huss died?	SELECT DISTINCT ?uri WHERE { <Georges_Wolinski> <placeOfDeath> ?uri. <Judson_Huss> <deathPlace> ?uri}
Count all those whose youth club was managed by Luis Enrique.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <manager> <Luis_Enrique_(footballer)> . ?uri <youthclubs> ?x  . }
List all those whose relatives' nationality is United States.	SELECT DISTINCT ?uri WHERE { ?x <nationality> <United_States> . ?uri <relative> ?x  . }
List the important people of Maryland Jockey Club ?	SELECT DISTINCT ?uri WHERE { <Maryland_Jockey_Club> <keyPeople> ?uri }
List all the nicknames of the city which has Torun gingerbread as one of it?	SELECT DISTINCT ?uri WHERE { ?x <nickname> <Toruń_gingerbread> . ?x <nickname> ?uri  . }
List the children of the parent of Marvin Bush.	SELECT DISTINCT ?uri WHERE { <Marvin_Bush> <parent> ?x . ?x <children> ?uri  . }
Name the largest city in the county where there is a Cy-Fair High School.	SELECT DISTINCT ?uri WHERE { <Cy-Fair_High_School> <county> ?x . ?x <largestCity> ?uri  . }
List the origin of the weapons which were used in the American Revolutionary War.	SELECT DISTINCT ?uri WHERE { ?x <usedInWar> <American_Revolutionary_War> . ?x <origin> ?uri  . ?x <type> <Weapon>}
Name the movies in which music is given by Laurie Johnson and edited by Anthony Harvey?	SELECT DISTINCT ?uri WHERE {?uri <music> <Laurie_Johnson> . ?uri <editing> <Anthony_Harvey>  . ?uri <type> <Film>}
Who is the operator of FedExField?	SELECT DISTINCT ?uri WHERE { <FedExField> <operator> ?uri }
Where was pina Records founded which has also the name of Geography of Puerto Rico?	SELECT DISTINCT ?uri WHERE { <Geography_of_Puerto_Rico> <name> ?uri. <Pina_Records> <founded> ?uri}
Name some shows similar to the one whose theme song is made by Murray Gold.	SELECT DISTINCT ?uri WHERE { ?x <themeMusicComposer> <Murray_Gold> . ?uri <related> ?x  . ?uri <type> <TelevisionShow>}
Who is the founder of the trade union which affiliates with Amalgamated Association of Iron and Steel Workers?	SELECT DISTINCT ?uri WHERE { <Amalgamated_Association_of_Iron_and_Steel_Workers> <affiliation> ?x . ?x <founded> ?uri  . ?x <type> <TradeUnion>}
Where did 2016 Fort Lauderdale Strikers season take place?	SELECT DISTINCT ?uri WHERE { <2016_Fort_Lauderdale_Strikers_season> <ground> ?uri }
"To which company is the service ""Nintendo eShop"" associated with?"	SELECT DISTINCT ?uri WHERE {?uri <services> <Nintendo_eShop>  . ?uri <type> <Company>}
Count all the awards which were presented by something located in California.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <headquarter> <California> . ?uri <presenter> ?x  . ?uri <type> <Award>}
Which successor of McDonnell Douglas was built by Delta 3 ?	SELECT DISTINCT ?uri WHERE { <Delta_III> <manufacturer> ?uri. <McDonnell_Douglas> <successor> ?uri}
Name the key people of the non-profit organisations whose one of the key person is Lesley-Anne knight ?	SELECT DISTINCT ?uri WHERE { ?x <keyPeople> <Lesley-Anne_Knight> . ?x <keyPeople> ?uri  . }
Does Faaa International Airport serve tahiti too?	ASK WHERE { <Fa'a'ā_International_Airport> <cityServed> <Tahiti> }
Name a few who live in a place where Indian English is an official language	SELECT DISTINCT ?uri WHERE { ?x <officialLanguage> <Indian_English> . ?uri <residence> ?x  . }
Where has Garbage recorded its singles?	SELECT DISTINCT ?uri WHERE { ?x <producer> <Garbage_(band)> . ?x <recordedIn> ?uri  . ?x <type> <Single>}
Name the emplyer for which Manu cornet has worked and also written in Google Web Toolkit ?	SELECT DISTINCT ?uri WHERE { <Manu_Cornet> <employer> ?uri. <Google_Web_Toolkit> <author> ?uri}
Who has been the tenant of the stadium built by PCL construction firm?	SELECT DISTINCT ?uri WHERE { ?x <builder> <PCL_Construction> . ?x <tenant> ?uri  . ?x <type> <Stadium>}
Is my truly truly fair from the band of mitch miller?	ASK WHERE { <My_Truly,_Truly_Fair> <musicalBand> <Mitch_Miller> }
Who is married to Gerard Pique?	SELECT DISTINCT ?uri WHERE {?uri <partner> <Gerard_Piqué>  . }
Grey goose and eristoff is produced by which company?	SELECT DISTINCT ?uri WHERE { <Grey_Goose_(vodka)> <manufacturer> ?uri. <Eristoff> <manufacturer> ?uri . }
List the people who are in the board of an organization kickstarted in New York.	SELECT DISTINCT ?uri WHERE { ?x <foundation> <New_York> . ?uri <board> ?x  . ?uri <type> <Person>}
What sports can be played in Kharghar's schools	SELECT DISTINCT ?uri WHERE { ?x <city> <Kharghar> . ?x <sport> ?uri  . ?x <type> <School>}
Name the office holder whose battle is Siege of Fort Recovery and belongs to the Indian territory branch?	SELECT DISTINCT ?uri WHERE {?uri <battle> <Siege_of_Fort_Recovery> . ?uri <branch> <Indiana_Territory>  . ?uri <type> <OfficeHolder>}
List some companies founded by Jim Harris.	SELECT DISTINCT ?uri WHERE {?uri <foundedBy> <Jim_Harris_(entrepreneur)> }
Who rented the stadium where the UFC 152 took place?	SELECT DISTINCT ?uri WHERE { <UFC_152> <venue> ?x . ?x <tenant> ?uri  . ?x <type> <Stadium>}
Count all the TV shows which are related to the ones produced by Julie Gardner.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <executiveProducer> <Julie_Gardner> . ?uri <related> ?x  . ?uri <type> <TelevisionShow>}
Which part of the US political framework did Arthur P Bagby and Thomas Holliday Hicks both serve?	SELECT DISTINCT ?uri WHERE { <Arthur_P._Bagby> <order> ?uri. <Thomas_Holliday_Hicks> <order> ?uri . }
Name the president served by a lieutenant who succeeded Bob C Riley.	SELECT DISTINCT ?uri WHERE { ?x <predecessor> <Bob_C._Riley> . ?uri <lieutenant> ?x  . ?uri <type> <President>}
Count the different religions followed by Second Lieutenants in military.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <militaryRank> <Second_lieutenant> . ?x <religion> ?uri  . }
Which office of Walter Evans Edge is also the part of Atlantic seaboard fall lines ?	SELECT DISTINCT ?uri WHERE { <Atlantic_Seaboard_fall_line> <part> ?uri. <Walter_Evans_Edge> <office> ?uri}
In which movies has momoko kochi acted	SELECT DISTINCT ?uri WHERE {?uri <starring> <Momoko_Kōchi> }
Is lion an animal?	ASK WHERE { <Lion> <kingdom> <Animal> }
Count the different alma maters of people employed by the CNN.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <employer> <CNN> . ?x <almaMater> ?uri  . }
Give me the total number of commander of the military conflicts whose commander is Roundhead (Wyandot).	SELECT DISTINCT COUNT(?uri) WHERE { ?x <commander> <Roundhead_(Wyandot)> . ?x <commander> ?uri }
Name all the soccer players who played in an under 18 club for La Liga?	SELECT DISTINCT ?uri WHERE { ?x <league> <La_Liga> . ?uri <youthclubs> ?x  . ?uri <type> <SoccerPlayer>}
Name the common current team of the Shaun Thong and Kaan Onder?	SELECT DISTINCT ?uri WHERE { <Shaun_Thong> <currentTeam> ?uri. <Kaan_Önder> <currentTeam> ?uri . }
Whose doctoral student is Etienne Bieler?	SELECT DISTINCT ?uri WHERE {?uri <doctoralStudent> <Étienne_Biéler> }
Which silver medalist of the Tennis at the 2012 Summer Olympics Men's singles was also the flagbearer of Switzerland at the 2008 Summer Olympics	SELECT DISTINCT ?uri WHERE { <Tennis_at_the_2012_Summer_Olympics_–_Men's_singles> <silverMedalist> ?uri. <Switzerland_at_the_2008_Summer_Olympics> <flagbearer> ?uri}
Where did the genres originate which can be found in The Mudbloods?	SELECT DISTINCT ?uri WHERE { <The_Mudbloods> <genre> ?x . ?x <stylisticOrigin> ?uri  . }
In which city was Saleen Raptor designed and is also the birth location of Jimmy Diggs ?	SELECT DISTINCT ?uri WHERE { <Saleen_S5S_Raptor> <designer> ?uri. <Jimmy_Diggs> <birthPlace> ?uri}
Who are the writers of the singles whose music genre is Rhythm and blues ?	SELECT DISTINCT ?uri WHERE { ?x <genre> <Rhythm_and_blues> . ?x <writer> ?uri  . ?x <type> <Single>}
Where does the river end on whose border we find in Bjelasnica?	SELECT DISTINCT ?uri WHERE { ?x <border> <Bjelašnica> . ?x <mouthCountry> ?uri  . }
How many awards have royal designers for industry winners got?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <awards> <Royal_Designers_for_Industry> . ?x <award> ?uri  . ?uri <type> <Award>}
What shows are aired on sister channels of BBC Parliaments?	SELECT DISTINCT ?uri WHERE { ?x <sisterNames> <BBC_Parliament> . ?uri <network> ?x  . ?uri <type> <TelevisionShow>}
List the shows whose network is run by BBC.	SELECT DISTINCT ?uri WHERE { ?x <owningCompany> <BBC> . ?uri <network> ?x  . ?uri <type> <TelevisionShow>}
In how many districts there are stations with borough called tendring?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <borough> <Tendring> . ?x <district> ?uri  . }
List all the co-founders of the non-profit organisations which have founding member as David pressman?	SELECT DISTINCT ?uri WHERE { ?x <foundedBy> <David_Pressman> . ?x <foundedBy> ?uri  . ?x <type> <Non-ProfitOrganisation>}
Which info. appliance is manufactured by Asus and is the successor of PS 2?	SELECT DISTINCT ?uri WHERE {?uri <predecessor> <PlayStation_2> . ?uri <manufacturer> <Asus>  . ?uri <type> <InformationAppliance>}
List the birth city of the politicians of Democratic Party.	SELECT DISTINCT ?uri WHERE { ?x <party> <Democratic_Party_(United_States)> . ?x <birthPlace> ?uri  . ?x <type> <Politician>}
List the successor of successor of Hayden, Stone & Co.	SELECT DISTINCT ?uri WHERE { <Hayden,_Stone_&_Co.> <successor> ?x . ?x <successor> ?uri  . }
What has been founded in the state that Denton county, Texas is a part of? 	SELECT DISTINCT ?uri WHERE { ?x <part> <Denton_County,_Texas> . ?uri <foundationPlace> ?x  . }
List the television shows whose network's executive officer is Steve Burke.	SELECT DISTINCT ?uri WHERE { ?x <keyPerson> <Steve_Burke_(businessman)> . ?uri <network> ?x  . ?uri <type> <TelevisionShow>}
How many other ingredient are there in the foods which have one of the ingredient as Potato ?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <ingredient> <Potato> . ?x <ingredient> ?uri }
Which river goes through cohoes, NY	SELECT DISTINCT ?uri WHERE { <Cohoes,_New_York> <river> ?uri }
Count the different causes of death of Christians.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <religion> <Christianity> . ?x <deathCause> ?uri  . }
List the cast member of the movies whose producer is Mark Johnson.	SELECT DISTINCT ?uri WHERE { ?x <producer> <Mark_Johnson_(producer)> . ?x <starring> ?uri  . ?x <type> <Film>}
What is the currency of the government type of Kerguelen Islands?	SELECT DISTINCT ?uri WHERE { <Kerguelen_Islands> <governmentType> ?x . ?x <currency> ?uri  . }
Which associate of Martin Pugh is also married to Alana Stewert?	SELECT DISTINCT ?uri WHERE { <Martin_Pugh> <associatedActs> ?uri. <Alana_Stewart> <spouse> ?uri}
To what did the parliament member swore her oath to, whose son is Lohan Ratwatte?	SELECT DISTINCT ?uri WHERE { ?x <child> <Lohan_Ratwatte> . ?x <allegiance> ?uri  . ?x <type> <MemberOfParliament>}
"What shows used to air on the channel which was earlier known as ""The Comedy Central""?"	SELECT DISTINCT ?uri WHERE { ?x <predecessor> <The_Comedy_Channel_(United_States)> . ?uri <distributor> ?x  . ?uri <type> <TelevisionShow>}
Which  office holder's resting place is Alta Mesa Memorial Park and has Henry E. Catto, Jr. as predecessor ?	SELECT DISTINCT ?uri WHERE {?uri <restingPlace> <Alta_Mesa_Memorial_Park> . ?uri <predecessor> <Henry_E._Catto,_Jr.>  . ?uri <type> <OfficeHolder>}
Give me a count of everything made by the company which offers electronical manufacturing too.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <service> <Electronics_manufacturing_services> . ?uri <manufacturer> ?x  . }
Who first ascended a mountain of Mount Hoffmann?	SELECT DISTINCT ?uri WHERE { <Mount_Hoffmann> <firstAscentPerson> ?uri }
Which books were published by Thomas Egerton?	SELECT DISTINCT ?uri WHERE {?uri <publisher> <Thomas_Egerton_(publisher)>  . ?uri <type> <Book>}
List the debut team of the baseball player who born in Houston.	SELECT DISTINCT ?uri WHERE { ?x <birthPlace> <Houston> . ?x <debutTeam> ?uri  . ?x <type> <BaseballPlayer>}
List the movies whose cast member were born in Scotland.	SELECT DISTINCT ?uri WHERE { ?x <birthPlace> <Scotland> . ?uri <starring> ?x  . ?uri <type> <Film>}
Which river has St. Louis as mouth mountain and Madison River as a right tributary?	SELECT DISTINCT ?uri WHERE {?uri <mouthMountain> <St._Louis> . ?uri <rightTributary> <Madison_River>  . ?uri <type> <River>}
List the mascot of the universities which are a part of National Collegiate Athletic Association.	SELECT DISTINCT ?uri WHERE { ?x <athletics> <National_Collegiate_Athletic_Association> . ?x <mascot> ?uri  . ?x <type> <University>}
Where can i find teams whose coach has been Rodney Eade.	SELECT DISTINCT ?uri WHERE { ?x <coach> <Rodney_Eade> . ?x <location> ?uri  . ?x <type> <SportsTeam>}
Name the college of the Allama Matthews which also has affiliation with  Monroe Carell Jr. Children's Hospital at Vanderbilt	SELECT DISTINCT ?uri WHERE { <Allama_Matthews> <college> ?uri. <Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt> <affiliation> ?uri}
Count the origin of the beverages which have been originated in england?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <origin> <England> . ?x <origin> ?uri }
Which office holder allegiance is Colony of Virginia and has a wife named Dolley Madison?	SELECT DISTINCT ?uri WHERE {?uri <spouse> <Dolley_Madison> . ?uri <allegiance> <Colony_of_Virginia>  . ?uri <type> <OfficeHolder>}
What newspapers's owners is Schibsted	SELECT DISTINCT ?uri WHERE {?uri <owners> <Schibsted>  . ?uri <type> <Newspaper>}
Where is the headquarters of the public transit system which operates Go-To card?	SELECT DISTINCT ?uri WHERE { <Go-To_card> <operator> ?x . ?x <headquarters> ?uri  . ?x <type> <PublicTransitSystem>}
Who are the animators of The Skeleton Dance?	SELECT DISTINCT ?uri WHERE { <The_Skeleton_Dance> <animator> ?uri }
How many different kinds of software have been released under the GNU General Public License?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <license> <GNU_General_Public_License> . ?x <genre> ?uri  . }
Which district of Robert William Wilcox is the place of birth of Kamaloohua ?	SELECT DISTINCT ?uri WHERE { <Robert_William_Wilcox> <district> ?uri. <Kamaloohua> <placeOfBirth> ?uri}
"Who is the performer of album which has the song ""To Where You Are"" ?"	SELECT DISTINCT ?uri WHERE { <To_Where_You_Are> <album> ?x . ?x <artist> ?uri  . }
Whose military branches are Colonial troops and Continental Army?	SELECT DISTINCT ?uri WHERE { ?uri <militaryBranch> <Colonial_troops> . ?uri <militaryBranch> <Continental_Army> . }
Give me the number of home stadiums of teams managed by John Spencer.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <manager> <John_Spencer_(Scottish_footballer)> . ?x <homeStadium> ?uri  . }
List the religions of the commanders of Royal Thai Army.	SELECT DISTINCT ?uri WHERE { <Royal_Thai_Army> <notableCommanders> ?x . ?x <religion> ?uri  . }
Count the different origins of members of the Vitis Vinifera species.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <species> <Vitis_vinifera> . ?x <origin> ?uri  . ?uri <type> <Place>}
Give me a list of all the people driving at pole positions in the Grands Prix where Renault was a first team?	SELECT DISTINCT ?uri WHERE { ?x <firstTeam> <Renault_in_Formula_One> . ?x <poleDriver> ?uri  . ?x <type> <GrandPrix>}
List places that are associated to cities in the state of Mecklenburg-Vorpommern.	SELECT DISTINCT ?uri WHERE { ?x <federalState> <Mecklenburg-Vorpommern> . ?uri <cities> ?x  . }
Who all have been canonized by Pope Paul VI?	SELECT DISTINCT ?uri WHERE {?uri <canonizedBy> <Pope_Paul_VI> }
What is the citizenship of the Sarah Kazemy and land of the Cervelle de canut	SELECT DISTINCT ?uri WHERE { <Sarah_Kazemy> <citizenship> ?uri. <Cervelle_de_canut> <country> ?uri}
Who wrote Heroman?	SELECT DISTINCT ?uri WHERE { <Heroman> <author> ?uri }
Is Microsoft office written in C++	ASK WHERE { <Microsoft_Office> <programmingLanguage> <C++> }
List the newspapers whose headquarters's time zone is Central European Summer Time.	SELECT DISTINCT ?uri WHERE { ?x <timeZone> <Central_European_Summer_Time> . ?uri <headquarters> ?x  . ?uri <type> <Newspaper>}
Which region of Bannock is the origin of Spaghetti squash ?	SELECT DISTINCT ?uri WHERE { <Spaghetti_squash> <origin> ?uri. <Bannock_(food)> <region> ?uri}
Which company assembles its cars in Broadmeadows, Victoria?	SELECT DISTINCT ?uri WHERE { ?x <assembly> <Broadmeadows,_Victoria> . ?x <parentCompany> ?uri  . ?x <type> <Automobile>}
Was Finding Nemo released before The Incredibles?	ASK WHERE { <The_Incredibles_(film_score)> <previousWork> <Finding_Nemo> }
List the agencies located someplace lead by Alex Chalk.	SELECT DISTINCT ?uri WHERE { ?x <leaderName> <Alex_Chalk> . ?uri <location> ?x  . ?uri <type> <GovernmentAgency>}
Did Steve Sampson manage a club of Santa Clara university	ASK WHERE { <Steve_Sampson> <managerClub> <Santa_Clara_University> }
How many people were drafted by the LA Clippers?	SELECT DISTINCT COUNT(?uri) WHERE {?uri <draftTeam> <Los_Angeles_Clippers>  . ?uri <type> <Person>}
List some people who were opponents of someone who was died by hanging?	SELECT DISTINCT ?uri WHERE { ?x <deathCause> <Hanging> . ?x <opponent> ?uri  . ?x <type> <Person>}
What is the venerated in of the Abraham and religion of the Saima Chowdhury?	SELECT DISTINCT ?uri WHERE { <Abraham> <veneratedIn> ?uri. <Saima_Chowdhury> <religion> ?uri}
Name the royalty whose mother was Cleopatra V and was married to Ptolemy XIV of Egypt?	SELECT DISTINCT ?uri WHERE {?uri <mother> <Cleopatra_V_of_Egypt> . ?uri <spouse> <Ptolemy_XIV_of_Egypt>  . ?uri <type> <Royalty>}
Give me a list of all the buildings which are located in districts governed by John Tory.	SELECT DISTINCT ?uri WHERE { ?x <leaderName> <John_Tory> . ?uri <location> ?x  . ?uri <type> <Building>}
When was Dick Redding born?	SELECT DISTINCT ?uri WHERE { <Dick_Redding> <birthDate> ?uri }
Which place of birth of Nina Vislova is also the largest city of Union State?	SELECT DISTINCT ?uri WHERE { <Union_State> <largestCity> ?uri. <Nina_Vislova> <placeOfBirth> ?uri}
List all the narrators of the albums which had Alan Barzman as one of the narrator ?	SELECT DISTINCT ?uri WHERE { ?x <narrated> <Alan_Barzman> . ?x <narrated> ?uri  . ?x <type> <Album>}
Name the mountain range of Le Giblou?	SELECT DISTINCT ?uri WHERE { <Le_Gibloux> <mountainRange> ?uri }
What stadium's operator is Stan Kroenke?	SELECT DISTINCT ?uri WHERE {?uri <operator> <Stan_Kroenke>  . ?uri <type> <Stadium>}
How many TV shows are of the company which has the subsidiary Big Ticket Entertainment?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <subsidiary> <Big_Ticket_Entertainment> . ?uri <company> ?x  . ?uri <type> <TelevisionShow>}
What are the settlements whose neighbouring municipality is Lancy?	SELECT DISTINCT ?uri WHERE {?uri <neighboringMunicipalities> <Lancy>  . ?uri <type> <Settlement>}
Which famous political figure appointed william cushing, and also founded Pittsburgh>	SELECT DISTINCT ?uri WHERE { <Pittsburgh> <founder> ?uri. <William_Cushing> <appointer> ?uri}
What is the scientist whose PhD students are Erich Bagge and Serban Titeica?	SELECT DISTINCT ?uri WHERE { ?uri <doctoralStudents> <Erich_Bagge> . ?uri <doctoralStudents> <Șerban_Țițeica> . ?uri <type> <Scientist>}
Which work institutions of Andrew Schally is the alma mater of Mara Eugenia Rojas Correa ?	SELECT DISTINCT ?uri WHERE { <Andrew_Schally> <workInstitutions> ?uri. <María_Eugenia_Rojas_Correa> <almaMater> ?uri}
Name some people working at someplace owned by News Corp.	SELECT DISTINCT ?uri WHERE { ?x <owners> <News_Corp> . ?uri <employer> ?x  . }
List the birthplace of the medicians who studied in Harvard.	SELECT DISTINCT ?uri WHERE { ?x <institution> <Harvard_Medical_School> . ?x <birthPlace> ?uri  . ?x <type> <Medician>}
Which movies's screenplay is written by Akiva Goldsman	SELECT DISTINCT ?uri WHERE {?uri <screenplay> <Akiva_Goldsman>  . ?uri <type> <Film>}
List the awards won by the wife of Ingrid von Rosen.	SELECT DISTINCT ?uri WHERE { <Ingrid_von_Rosen> <spouse> ?x . ?x <awards> ?uri  . }
Give me some organizations working for Environmentalism?	SELECT DISTINCT ?uri WHERE {?uri <purpose> <Environmentalism>  . ?uri <type> <Organisation>}
What is the country whose leader name is Gerard Larcher?	SELECT DISTINCT ?uri WHERE {?uri <leaderName> <Gérard_Larcher>  . ?uri <type> <Country>}
Count the tenants of the stadiums owned by toronto.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <owner> <Toronto> . ?x <tenants> ?uri  . }
What are the srvices of Laemmle Theatres?	SELECT DISTINCT ?uri WHERE { <Laemmle_Theatres> <service> ?uri }
In how many different places have ethics philosophers died?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <mainInterests> <Ethics> . ?x <placeOfDeath> ?uri  . ?uri <type> <Place>}
Count all the different purposes followed by the different NGOs.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <type> <Non-governmental_organization> . ?x <purpose> ?uri  . }
Count the different religions practiced by people who are in the Malaysian and Chinese association.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <party> <Malaysian_Chinese_Association> . ?x <religion> ?uri  . }
What are some apes?	SELECT DISTINCT ?uri WHERE {?uri <family> <Ape>  . }
Count the total religions followed by the ones living in England.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <residence> <England> . ?x <religion> ?uri  . }
List the producer of the TV shows whose company is HBO.	SELECT DISTINCT ?uri WHERE { ?x <company> <HBO> . ?x <producer> ?uri  . ?x <type> <TelevisionShow>}
What is the purpose of the Maharashtra Chess Association which is the genre of PyChess?	SELECT DISTINCT ?uri WHERE { <Maharashtra_Chess_Association> <purpose> ?uri. <PyChess> <genre> ?uri}
Is Maldives a member of South Asia Subregional Economic Cooperation?	ASK WHERE { <South_Asia_Subregional_Economic_Cooperation> <membership> <Maldives> }
Which license of the Microsoft Office Picture Manager is also the  product of the Apple Productivity Experience Group	SELECT DISTINCT ?uri WHERE { <Microsoft_Office_Picture_Manager> <license> ?uri. <Apple_Productivity_Experience_Group> <product> ?uri}
What foundation place of Temenos Group is the death place of jerzy Jzef Poocki ?	SELECT DISTINCT ?uri WHERE { <Temenos_Group> <foundation> ?uri. <Jerzy_Józef_Potocki> <placeOfDeath> ?uri}
What is the municipality of the Brown's Corners, Toronto and also the  place of birth of the George Karrys	SELECT DISTINCT ?uri WHERE { <Brown's_Corners,_Toronto> <municipality> ?uri. <George_Karrys> <placeOfBirth> ?uri}
What sports team's arena is The Palace of Auburn Hills	SELECT DISTINCT ?uri WHERE {?uri <arena> <The_Palace_of_Auburn_Hills>  . ?uri <type> <SportsTeam>}
In how many different fields people are alumini of the University of Oxford working?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <almaMater> <Worcester_College,_Oxford> . ?x <field> ?uri  . }
List the ethnicity of Riley Reid.	SELECT DISTINCT ?uri WHERE { <Riley_Reid> <ethnicity> ?uri }
Where is Jimmy Wales a board member which also owns Latvian Wikipedia?	SELECT DISTINCT ?uri WHERE { <Jimmy_Wales> <board> ?uri. <Latvian_Wikipedia> <owner> ?uri}
List the television shows whose network's sister names is N-tv.	SELECT DISTINCT ?uri WHERE { ?x <sisterNames> <N-tv> . ?uri <network> ?x  . ?uri <type> <TelevisionShow>}
Who is the president of Carl Stokes and Wyche Fowler ?	SELECT DISTINCT ?uri WHERE { <Carl_Stokes> <president> ?uri. <Wyche_Fowler> <president> ?uri}
For what was Jack Ryan a nominee?	SELECT DISTINCT ?uri WHERE { <Jack_Ryan_(politician)> <nominee> ?uri }
List the common sports between Fr. Agnel Multipurpose School  and Jamiatu Muslim Mindanao	SELECT DISTINCT ?uri WHERE { <Fr._Agnel_Multipurpose_School_and_Junior_College> <sport> ?uri. <Jamiatu_Muslim_Mindanao> <athletics> ?uri}
Name the team which is the owner of Dafenham wind turbines and stood first in 1967 mexican Grand Prix?	SELECT DISTINCT ?uri WHERE { <1967_Mexican_Grand_Prix> <firstTeam> ?uri. <Dagenham_wind_turbines> <owner> ?uri}
What is the country where Sergei Ovchinnikov the volleyball player died, and Gumus was first aired ?	SELECT DISTINCT ?uri WHERE { <Gümüş_(TV_series)> <firstAired> ?uri. <Sergei_Ovchinnikov_(volleyball)> <placeOfDeath> ?uri}
Which movie was produced by Michael Deeley and had Jordan Cronenweth as director of photography?	SELECT DISTINCT ?uri WHERE {?uri <producer> <Michael_Deeley> . ?uri <cinematography> <Jordan_Cronenweth>  . ?uri <type> <Film>}
Which shows had their creators born in England?	SELECT DISTINCT ?uri WHERE { ?x <birthPlace> <England> . ?uri <creator> ?x  . ?uri <type> <TelevisionShow>}
List the governors of Jimmie Lou Fisher?	SELECT DISTINCT ?uri WHERE { <Jimmie_Lou_Fisher> <governor> ?uri }
Find the total number of ingredients of the recepies whose ingredient is common Mushroom ?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <ingredient> <Agaricus_bisporus> . ?x <ingredient> ?uri }
How many licensees are there, of the radio stations whose area is Nashville, Tennessee?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <area> <Nashville,_Tennessee> . ?x <licensee> ?uri  . }
List the series of the books whose author is K. W. Jeter.	SELECT DISTINCT ?uri WHERE { ?x <author> <K._W._Jeter> . ?x <series> ?uri  . ?x <type> <Book>}
Does Grand Bahama lie in the achipelago of the bahamas?	ASK WHERE { <Grand_Bahama> <archipelago> <The_Bahamas> }
How many parties are there of the office holders whose one of the party is Janata Dal ?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <otherParty> <Janata_Dal> . ?x <otherParty> ?uri }
Give me the total number of lines owned by owner of Metro-Noth Railroad ?	SELECT DISTINCT COUNT(?uri) WHERE { ?x <owner> <Metro-North_Railroad> . ?x <owner> ?uri }
Name some dishes made with flowering plants.	SELECT DISTINCT ?uri WHERE { ?x <division> <Flowering_plant> . ?uri <ingredient> ?x  . ?uri <type> <Food>}
Name the team for which Hensley Meulens played, which was also the debut team of Steve Ontiveros ?	SELECT DISTINCT ?uri WHERE { <Steve_Ontiveros_(infielder)> <debutteam> ?uri. <Hensley_Meulens> <team> ?uri}
Who is the local authority of Buckhurst Hill County High School ?	SELECT DISTINCT ?uri WHERE { <Buckhurst_Hill_County_High_School> <localAuthority> ?uri }
Name all those buried in a place governed by a city council.	SELECT DISTINCT ?uri WHERE { ?x <governingBody> <City_council> . ?uri <restingPlace> ?x  . }
What are the professions of Ralph flanders?	SELECT DISTINCT ?uri WHERE { <Ralph_Flanders> <occupation> ?uri }
Count all the stateless people.	SELECT DISTINCT COUNT(?uri) WHERE {?uri <citizenship> <Statelessness>  . }
What are the films where at least one cast member died due to colorectal cancer?	SELECT DISTINCT ?uri WHERE { ?x <deathCause> <Colorectal_cancer> . ?uri <starring> ?x  . ?uri <type> <Film>}
What are the things whose leader was a monarch Willem-Alexander of the Netherlands?	SELECT DISTINCT ?uri WHERE { ?x <monarch> <Willem-Alexander_of_the_Netherlands> . ?uri <leader> ?x  . }
Count the journals in the field of Philosophy.	SELECT DISTINCT COUNT(?uri) WHERE {?uri <discipline> <Philosophy>  . ?uri <type> <AcademicJournal>}
Which company's division is Audi India? Correct Question	SELECT DISTINCT ?uri WHERE {?uri <divisions> <Audi_India> }
Name the members of youth clubs which have Camp Nou as their homeground.	SELECT DISTINCT ?uri WHERE { ?x <ground> <Camp_Nou> . ?uri <youthclubs> ?x  . }
Count the number of families of the Animal kingdom.	SELECT DISTINCT COUNT(?uri) WHERE { ?x <kingdom> <Animal> . ?x <family> ?uri  . }
